In [1]:
# 1) List any five functions of the pandas library with execution.
import pandas as pd
df = pd.read_csv("https://raw.githubusercontent.com/datasciencedojo/datasets/master/titanic.csv")

In [2]:
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [3]:
df.tail()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.00,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.00,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.45,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.00,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.75,NaN,Q

In [4]:
df.describe()

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
count,891.000000,891.000000,891.000000,714.000000,891.000000,891.000000,891.000000
mean,446.000000,0.383838,2.308642,29.699118,0.523008,0.381594,32.204208
std,257.353842,0.486592,0.836071,14.526497,1.102743,0.806057,49.693429
min,1.000000,0.000000,1.000000,0.420000,0.000000,0.000000,0.000000
25%,223.500000,0.000000,2.000000,20.125000,0.000000,0.000000,7.910400
50%,446.000000,0.000000,3.000000,28.000000,0.000000,0.000000,14.454200
75%,668.500000,1.000000,3.000000,38.000000,1.000000,0.000000,31.000000
max,891.000000,1.000000,3.000000,80.000000,8.000000,6.000000,512.329200

In [5]:
df.dtypes

PassengerId      int64
Survived         int64
Pclass           int64
Name            object
Sex             object
Age            float64
SibSp            int64
Parch            int64
Ticket          object
Fare           float64
Cabin           object
Embarked        object
dtype: object

In [6]:
df.select_dtypes(include=['object'])

,Name,Sex,Ticket,Cabin,Embarked
0,"Braund, Mr. Owen Harris",male,A/5 21171,NaN,S
1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,PC 17599,C85,C
2,"Heikkinen, Miss. Laina",female,STON/O2. 3101282,NaN,S
3,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,113803,C123,S
4,"Allen, Mr. William Henry",male,373450,NaN,S
...,...,...,...,...,...
886,"Montvila, Rev. Juozas",male,211536,NaN,S
887,"Graham, Miss. Margaret Edith",female,112053,B42,S
888,"Johnston, Miss. Catherine Helen ""Carrie""",female,W./C. 6607,NaN,S
889,"Behr, Mr. Karl Howell",male,111369,C148,C
890,"Dooley, Mr. Patrick",male,370376,NaN,Q

In [7]:
import numpy as np
data = {'Name': ['Alice', 'Bob', 'Charlie', 'David'],
        'Age': [25, np.nan, 35, 30],
        'City': ['New York', 'Paris', np.nan, 'London'],
        'Salary': [50000, 60000, 70000, np.nan]}
df = pd.DataFrame(data)
df.dropna()
#  drop rows with missing values

    Name   Age      City   Salary
0  Alice  25.0  New York  50000.0

In [8]:
df.columns

Index(['Name', 'Age', 'City', 'Salary'], dtype='object')

In [9]:
# Q2. Given a Pandas DataFrame df with columns 'A', 'B', and 'C', write a Python function to re-index the
# DataFrame with a new index that starts from 1 and increments by 2 for each row.

In [10]:
data = {
    "A" : [1,2,3],
    "B" : [4,5,6],
    "C" : [7,8,9]
}
pd.DataFrame(data)

   A  B  C
0  1  4  7
1  2  5  8
2  3  6  9

In [14]:
df = pd.DataFrame(data)

In [19]:
def reindex_dataframe(df):
    df.index = pd.RangeIndex(start=1, stop=len(df)*2, step=2)
    return df

In [20]:
reindex_dataframe(df)

   A  B  C
1  1  4  7
3  2  5  8
5  3  6  9

In [22]:
# Q3. You have a Pandas DataFrame df with a column named 'Values'. Write a Python function that
# iterates over the DataFrame and calculates the sum of the first three values in the 'Values' column. The
# function should print the sum to the console.

In [27]:
pd.DataFrame({
    "values" : [1,2,3,4,5,6,7]
})

   values
0       1
1       2
2       3
3       4
4       5
5       6
6       7

In [41]:
df1 = pd.DataFrame({
    "values" : [10,20,30,40,50]
})

In [42]:
def sum_Fun(df1):
  sum = 0
  count = 0
  for i in df1['values']:
    if count>=3:
        return sum
    else:
        sum += i
        count += 1

In [43]:
sum_Fun(df1)

60

In [44]:
# Q4. Given a Pandas DataFrame df with a column 'Text', write a Python function to create a new column
# 'Word_Count' that contains the number of words in each row of the 'Text' column.

In [70]:
df2 = pd.DataFrame({
    'Text' : ['The quick brown fox', 'jumps over the lazy dog']
})

In [71]:
word_count = lambda text : len(text.split())
df2['Word_Count'] = df2['Text'].apply(word_count)
# The apply() method then returns a new Series object containing the results of applying the function to each element of the original Series. This new Series object is then 
# assigned to a new column 'Word_Count' in the DataFrame using bracket notation

In [64]:
df2

                      Text  Word_Count
0      The quick brown fox           4
1  jumps over the lazy dog           5

In [72]:
# or
word_counts = []
for index, row in df2.iterrows():
    count = len(row['Text'].split())
    
    word_counts.append(count)

In [73]:
df2['Word_Count'] = word_counts

In [74]:
df2

                      Text  Word_Count
0      The quick brown fox           4
1  jumps over the lazy dog           5

In [76]:
# Q5. How are DataFrame.size() and DataFrame.shape() different?

In [83]:
df = pd.DataFrame({
    "A" : [1,2,3],
    "B" : [4,5,6]
})
# DataFrame.size() returns the total number of elements in DataFrame 
size = df.size
print(size)

6

In [85]:
# DataFrame.shape returns Nuber of rows and colums in DataFrame
df.shape

(3, 2)

In [89]:
# Q6. Which function of pandas do we use to read an excel file?
# pd.read_excel()

In [90]:
# Q7. You have a Pandas DataFrame df that contains a column named 'Email' that contains email
# addresses in the format 'username@domain.com'. Write a Python function that creates a new column
# 'Username' in df that contains only the username part of each email address.

In [106]:
df = pd.DataFrame({
    'Email' : ["ThallapallyArun49@gmail.com", "sudhanshu@gmail.com", "pwskills@gmail.com" "krish@gmail.com" ]
})

In [107]:
def extract_name(email):
    return email.split('@')[0]

name_list = [extract_name(email) for email in df['Email']]

In [103]:
name_list

['ThallapallyArun49', 'sudhanshu', 'krish']

In [104]:
df["user_name"] = name_list

In [105]:
df

                         Email          user_name
0  ThallapallyArun49@gmail.com  ThallapallyArun49
1          sudhanshu@gmail.com          sudhanshu
2              krish@gmail.com              krish

In [108]:
email = 'john.doe@example.com'
name = email.split('@')[0]

In [110]:
name

'john.doe'

In [112]:
# Q8. You have a Pandas DataFrame df with columns 'A', 'B', and 'C'. Write a Python function that selects
# all rows where the value in column 'A' is greater than 5 and the value in column 'B' is less than 10. The
# function should return a new DataFrame that contains only the selected rows.
# For example, if df contains the following values:
# A B C
# 0 3 5 1
# 1 8 2 7
# 2 6 9 4
# 3 2 3 5
# 4 9 1 2

In [113]:
pd.DataFrame({
    "A" : [3,8,6,2,9],
    "B" : [5,2,9,3,1],
    "C" : [1,7,4,5,2]
})

   A  B  C
0  3  5  1
1  8  2  7
2  6  9  4
3  2  3  5
4  9  1  2

In [118]:
df = pd.DataFrame({
    "A" : [3,8,6,2,9],
    "B" : [5,2,9,3,1],
    "C" : [1,7,4,5,2]
})

In [121]:
df[df['A']>5]

   A  B  C
1  8  2  7
2  6  9  4
4  9  1  2

In [122]:
df[df['B']<10]

   A  B  C
0  3  5  1
1  8  2  7
2  6  9  4
3  2  3  5
4  9  1  2

In [123]:
df[(df['A']>5) & (df['B']<10)]

   A  B  C
1  8  2  7
2  6  9  4
4  9  1  2

In [124]:
# Q9. Given a Pandas DataFrame df with a column 'Values', write a Python function to calculate the mean,
# median, and standard deviation of the values in the 'Values' column.

In [127]:
df = pd.DataFrame({
    'values' : [10,20,30,40]
})

In [128]:
df.mean()

values    25.0
dtype: float64

In [129]:
df.median()

values    25.0
dtype: float64

In [130]:

def calculate_stats(df, column_name):
   
    # Calculate mean
    mean_value = df[column_name].mean()

    # Calculate median
    median_value = df[column_name].median()

    # Calculate standard deviation
    std_value = df[column_name].std()


    return mean_value, median_value, std_value

In [132]:
calculate_stats(df, 'values')

(25.0, 25.0, 12.909944487358056)

In [1]:
import pandas as pd
# Q10. Given a Pandas DataFrame df with a column 'Sales' and a column 'Date', write a Python function to
# create a new column 'MovingAverage' that contains the moving average of the sales for the past 7 days
# for each row in the DataFrame. The moving average should be calculated using a window of size 7 and
# should include the current day.

In [6]:
data = {
    "sales" : [10, 15, 20, 25, 30, 35, 40, 45, 50, 55, 60],
    'Date' : pd.date_range('2023-02-27', periods = 11, freq='D')
}
df = pd.DataFrame(data)

In [7]:
def add_moving_average(df):
    df['MovingAverage'] = df['sales'].rolling(window = 7, min_periods=1).mean()
    return df

In [8]:
add_moving_average(df)

    sales       Date  MovingAverage
0      10 2023-02-27           10.0
1      15 2023-02-28           12.5
2      20 2023-03-01           15.0
3      25 2023-03-02           17.5
4      30 2023-03-03           20.0
5      35 2023-03-04           22.5
6      40 2023-03-05           25.0
7      45 2023-03-06           30.0
8      50 2023-03-07           35.0
9      55 2023-03-08           40.0
10     60 2023-03-09           45.0

In [9]:
# Q11. You have a Pandas DataFrame df with a column 'Date'. Write a Python function that creates a new
# column 'Weekday' in the DataFrame. The 'Weekday' column should contain the weekday name (e.g.
# Monday, Tuesday) corresponding to each date in the 'Date' column.
# For example, if df contains the following values:
# Date
# 0 2023-01-01
# 1 2023-01-02
# 2 2023-01-03
# 3 2023-01-04
# 4 2023-01-05

In [20]:
dates = pd.date_range(start='2023-01-01', periods=5)

In [22]:
df = pd.DataFrame({
    'Date' : dates
})

In [24]:
df

        Date
0 2023-01-01
1 2023-01-02
2 2023-01-03
3 2023-01-04
4 2023-01-05

In [29]:
df['WeekDay'] = df['Date'].dt.strftime("%A")

In [30]:
df

        Date    WeekDay
0 2023-01-01     Sunday
1 2023-01-02     Monday
2 2023-01-03    Tuesday
3 2023-01-04  Wednesday
4 2023-01-05   Thursday

In [40]:
# Q12. Given a Pandas DataFrame df with a column 'Date' that contains timestamps, write a Python
# function to select all rows where the date is between '2023-01-01' and '2023-01-31'.

In [43]:
import pandas as pd

# Create a sample DataFrame with a 'Date' column containing timestamps
df = pd.DataFrame({'Date': pd.date_range(start='2023-01-01', end='2023-02-28')})

# Select rows where the 'Date' column falls between '2023-01-01' and '2023-01-31'
mask = (df['Date'] > '2023-01-01') & (df['Date'] < '2023-01-31')
selected_rows = df.loc[mask]

# Print the selected rows
print(selected_rows)

         Date
1  2023-01-02
2  2023-01-03
3  2023-01-04
4  2023-01-05
5  2023-01-06
6  2023-01-07
7  2023-01-08
8  2023-01-09
9  2023-01-10
10 2023-01-11
11 2023-01-12
12 2023-01-13
13 2023-01-14
14 2023-01-15
15 2023-01-16
16 2023-01-17
17 2023-01-18
18 2023-01-19
19 2023-01-20
20 2023-01-21
21 2023-01-22
22 2023-01-23
23 2023-01-24
24 2023-01-25
25 2023-01-26
26 2023-01-27
27 2023-01-28
28 2023-01-29
29 2023-01-30

In [44]:
# Q13. To use the basic functions of pandas, what is the first and foremost necessary library that needs to
# be imported?

In [45]:
import pandas as pd

In [ ]:
# The as pd part of the import statement is optional, but it is commonly used to provide a shorthand reference to the library when calling its functions.